
# 数据整理
------------------------------

## pandas 缺失值数据处理
## 特殊常量None一般在python中表示缺失值

In [1]:
import pandas as pd 
import numpy as np

In [19]:
a = np.array([1,np.nan,3,4])

In [32]:
np.sum(a)

nan

In [35]:
s = pd.Series(a)

In [38]:
s[s.notnull()]

0    1.0
2    3.0
3    4.0
dtype: float64

In [39]:
d = pd.DataFrame(np.arange(20).reshape(4,5))

In [92]:
d[2][1]=np.nan
d

/home/lf/anaconda/lib/python3.7/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

    0   1     2   3     4
0   0   1   2.0   3   4.0
1   5   6   NaN   8   9.0
2  10  11  12.0  13  14.0
3  15  16  17.0  18   NaN

In [93]:
d.loc[3,4]=np.nan

In [94]:
d

    0   1     2   3     4
0   0   1   2.0   3   4.0
1   5   6   NaN   8   9.0
2  10  11  12.0  13  14.0
3  15  16  17.0  18   NaN

In [95]:
d

    0   1     2   3     4
0   0   1   2.0   3   4.0
1   5   6   NaN   8   9.0
2  10  11  12.0  13  14.0
3  15  16  17.0  18   NaN

In [100]:
s.fillna(method='bfill')

0    1.0
1    3.0
2    3.0
3    4.0
dtype: float64

In [101]:
d

    0   1     2   3     4
0   0   1   2.0   3   4.0
1   5   6   NaN   8   9.0
2  10  11  12.0  13  14.0
3  15  16  17.0  18   NaN

In [104]:
d.fillna(method='ffill',axis=1)

      0     1     2     3     4
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   6.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  18.0

In [107]:
d.loc[3]=np.nan
d.loc[1:3,0]=np.nan

In [109]:
d

     0     1     2     3     4
0  0.0   1.0   2.0   3.0   4.0
1  NaN   6.0   NaN   8.0   9.0
2  NaN  11.0  12.0  13.0  14.0
3  NaN   NaN   NaN   NaN   NaN

In [110]:
d.fillna(1,limit=1)

     0     1     2     3     4
0  0.0   1.0   2.0   3.0   4.0
1  1.0   6.0   1.0   8.0   9.0
2  NaN  11.0  12.0  13.0  14.0
3  NaN   1.0   NaN   1.0   1.0

In [118]:
d.replace({np.nan:3})

     0     1     2     3     4
0  0.0   1.0   2.0   3.0   4.0
1  3.0   6.0   3.0   8.0   9.0
2  3.0  11.0  12.0  13.0  14.0
3  3.0   3.0   3.0   3.0   3.0

In [120]:
s

0    1.0
1    NaN
2    3.0
3    4.0
dtype: float64

In [121]:
tmp = {1:'a',np.nan:'b',3:'c',4:'d'}
s.map(tmp)

0    a
1    b
2    c
3    d
dtype: object

In [144]:
p = pd.DataFrame({'k1':['one']*3+['two']*2,'k2':[1,1,2,3,3]})

In [146]:
p.loc[5]=['one',2]

In [147]:
p

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  one   2

In [148]:
p.duplicated()

0    False
1     True
2    False
3    False
4     True
5     True
dtype: bool

In [149]:
p[-p.duplicated()]

    k1  k2
0  one   1
2  one   2
3  two   3

In [150]:
p

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  one   2

In [152]:
p.drop_duplicates()

    k1  k2
0  one   1
2  one   2
3  two   3